OpenFoam/Natural_Convection/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0.1 0) // 0
    (0.0707 0.0707 0) // 1
    (0.0707 -0.0707 0) // 2
    (0 -0.1 0) //3
    (0 0.4 0) //4
    (0.283 0.283 0) //5
    (0.283 -0.283 0) //6 
    (0 -0.4 0) //7
    (0 -1 0) //8
    (0.283 -1 0) //9
    (1 -1 0) //10
    (1 -0.283 0) //11
    (1 0.283 0) //12
    (1 2 0) //13
    (0.283 2 0) //14
    (0 2 0) //15

    (0 0.1 0.01) //16
    (0.0707 0.0707 0.01) //17
    (0.0707 -0.0707 0.01) //18
    (0 -0.1 0.01) //19
    (0 0.4 0.01) //20
    (0.283 0.283 0.01) //21
    (0.283 -0.283 0.01) //22
    (0 -0.4 0.01) //23
    (0 -1 0.01) //24
    (0.283 -1 0.01) //25
    (1 -1 0.01) //26
    (1 -0.283 0.01) //27
    (1 0.283 0.01) //28
    (1 2 0.01) //29
    (0.283 2 0.01) //30
    (0 2 0.01) //31

);

blocks
(
    hex (0 1 5 4 16 17 21 20) (30 30 1) simpleGrading (1 1 1) // 0
    hex (1 2 6 5 17 18 22 21) (60 30 1) simpleGrading (1 1 1) // 1
    hex (2 3 7 6 18 19 23 22) (30 30 1) simpleGrading (1 1 1) // 2
    hex (6 7 8 9 22 23 24 25) (30 60 1) simpleGrading (1 1 1) // 3
    hex	(6 9 10 11 22 25 26 27) (60 70 1) simpleGrading (1 1 1) //4
    hex	(5 6 11 12 21 22 27 28) (60 70 1) simpleGrading (1 1 1) //5
    hex	(14 5 12 13 30 21 28 29) (140 70 1) simpleGrading (1 1 1) //6
    hex	(14 15 4 5 30 31 20 21) (30 140 1) simpleGrading (1 1 1) //7
);

edges
(
arc 3 2 (0.0383 -0.0924 0)
arc 2 1 (0 0.1 0)
arc 1 0 (0.0383 0.0924 0)
arc 19 18 (0.0383 -0.0924 0.01)
arc 18 17 (0 0.1 0.01)
arc 17 16 (0.0383 0.0924 0.01)
);

boundary
(
    right
    {
        type wall;
        faces
        (
            (13 12 28 29)
	    (12 11 27 28)
	    (11 10 26 27)
        );
    }
    circumference
    {
        type wall;
        faces
        (
            (0 1 17 16)
	    (1 2 18 17)
	    (2 3 19 18)
        );
    }
    left
    {
        type symmetryPlane;
        faces
        (
            (15 4 20 31)
            (0 4 16 20)
            (3 7 23 19)
            (7 8 24 23)
        );
    }
    up
    {
	type wall;
	faces
	(
 	    (15 14 30 31)
	    (14 13 29 30)
	);
    }
   down
    {
	type wall;
	faces
	(
	    (8 9 25 24)
	    (9 10 26 25)
	);
    }
   ahead
    {
	type empty;
	faces
	(
	    (0 1 5 4)
	    (1 2 6 5)
	    (2 3 7 6)
	    (6 7 8 9)
	    (6 9 10 11)
	    (5 6 11 12)
	    (14 5 12 13)
	    (15 4 5 14)
	);
    }
   behind
   {
	type empty;
	faces
	(
	    (20 16 17 21)
	    (21 17 18 22)
	    (18 19 23 22)
	    (22 23 24 25)
	    (22 25 26 27)
	    (21 22 27 28)
	    (30 21 28 29)
	    (31 20 21 30)
	);
   }
);
mergePatchPairs
(
);

// ************************************************************************* //
