OpenFoam/Natural_Convection/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    up
    {
        type            zeroGradient;
    }
    down
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    circumference
    {
        type            fixedValue;
	value		uniform 400;
    }
    left
    {
        type            symmetryPlane;
    }
    ahead
    {
        type            empty;
    }
    behind
    {
        type            empty;
    }
}

// ************************************************************************* //
