OpenFoam/Natural_Convection/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1e-3; //0.01;

boundaryField
{
    up
    {
        type            epsilonWallFunction;
        value           uniform 1e-3; //0.01;
    }
    down
    {
        type            epsilonWallFunction;
        value           uniform 1e-3; //0.01;
    }
    right
    {
        type            epsilonWallFunction;
        value           uniform 1e-3; //0.01;
    }
    circumference
    {
	type		epsilonWallFunction;
	value		uniform 1e-3; //0.01;
    }
    left
    {
	type		symmetryPlane;
    }
    ahead
    {
	type		empty;
    }
    behind
    {
	type		empty;
    }
}


// ************************************************************************* //
